
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       2 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                       |
|:--------:|:------------------------------------------------|
|    🟢     | `aws_iam_policy.openvpn-github-permissions`     |
|    🟢     | `aws_iam_role_policy_attachment.openvpn-github` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.openvpn-github-permissions will be created
  + resource "aws_iam_policy" "openvpn-github-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions policy for ih-tf-terraform-aws-openvpn-github role"
      + id               = (known after apply)
      + name             = "openvpn-github-permissions"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr-public:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ecr:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr-public::493370826424:repository/openvpn-portal"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # aws_iam_role_policy_attachment.openvpn-github will be created
  + resource "aws_iam_role_policy_attachment" "openvpn-github" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-terraform-aws-openvpn-github"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==
```
</details>